# BarsTooCloseSpacing Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarSystemFailures..::..BarsTooCloseSpacing Property
BuiltInFailures..::..RebarSystemFailures Class See Also
---
Bars are too close together. Increase the Maximum Spacing parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId BarsTooCloseSpacing { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BarsTooCloseSpacing As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ BarsTooCloseSpacing {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarSystemFailures Class
Autodesk.Revit.DB Namespace